Day 3/app/controllers/jokes_controller.rb

SELECT "jokes".* FROM "jokes"
---
  def index
    @jokes = Joke.all

SELECT "jokes".* FROM "jokes" WHERE "jokes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "jokes" SET "like" = ?, "updated_at" = ? WHERE "jokes"."id" = ?  [["like", 1], ["updated_at", "2024-04-01 14:17:13.748263"], ["id", 1]]
---
  def in_like
    current_like = Joke.find(params[:id])
    current_like.like +=1
    current_like.save

SELECT "jokes".* FROM "jokes" WHERE "jokes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "jokes" SET "dislike" = ?, "updated_at" = ? WHERE "jokes"."id" = ?  [["dislike", 1], ["updated_at", "2024-04-01 14:17:12.232444"], ["id", 1]]
---
  def in_dislike
    current_like = Joke.find(params[:id])
    current_like.dislike +=1
    current_like.save

SELECT "jokes".* FROM "jokes" WHERE "jokes"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def set_joke
    @joke = Joke.find(params[:id])